[
  {
    "id": 0,
    "title": "A crisis of trust Economist Maxim Ananyev on the subtle consequences of war and sanctions for Russia",
    "short": "Since the beginning of the war in Ukraine, the United States and European countries have imposed harsh sanctions against Russia in an attempt to force the country to halt its attacks and withdraw its troops. Russian citizens are already experiencing economic difficulties, including losing their jobs and businesses",
    "content": "Since the beginning of the war in Ukraine, the United States and European countries have imposed harsh sanctions against Russia in an attempt to force the country to halt its attacks and withdraw its troops. Russian citizens are already experiencing economic difficulties, including losing their jobs and businesses. Supporters of the sanctions contend that President Vladimir Putin is to blame for this. Could economic losses impact Russian politics and compel the government to reconsider its course? Research Fellow Maxim Ananyev from the Melbourne Institute of Applied Economic and Social Research explains."
  },
  {
    "id": 1,
    "title": "'We’ll all go back when the regime falls' How Tbilisi become a hub for Russian political emigrants",
    "short": "In the first weeks after Vladimir Putin announced his “special military operation” and invaded Ukraine, tens of thousands of Russians flew to Georgia, despite there being no direct flights there from Russia",
    "content": "In the first weeks after Vladimir Putin announced his “special military operation” and invaded Ukraine, tens of thousands of Russians flew to Georgia, despite there being no direct flights there from Russia. Many continued on to other countries, but about 12 thousand have stayed. One of those 12 thousand Russians, reports on what problems these Russians have faced — and how Georgians have responded to the Russian influx."
  },
  {
    "id": 2,
    "title": "One month later Twenty-eight snapshots that capture Russia’s destructive war against Ukraine",
    "short": "Today, March 24, 2022, marks one month since Vladimir Putin ordered Russian troops to undertake a full-scale invasion of Ukraine",
    "content": "Today, March 24, 2022, marks one month since Vladimir Putin ordered Russian troops to undertake a full-scale invasion of Ukraine. These four weeks have changed the country beyond recognition: Ukrainian cities — from Kharkiv to Volnovakha, and Mariupol to Kherson — have suffered widespread damage and destruction from bombardments; more than 3.6 million people have been forced to flee abroad as refugees. The United Nations has recorded at least 2,685 civilian casualties, including 1,035 killed and 1,650 injured. The real toll is much higher — thousands have reportedly died in besieged Mariupol alone. The actual number of military casualties, both Russian and Ukrainian, also remains unknown as yet. To bear witness to this catastrophic month, Meduza shares one photo from each day of Russia’s war against Ukraine."
  },
  {
    "id": 3,
    "title": "‘Nobody understood what was happening’ Meduza tells the story of Albert Sakhibgareyev — a Russian contract soldier who deserted from the war in Ukraine",
    "short": "Five weeks ago, 25-year-old contract soldier Albert Sakhibgareyev was in Russia’s Belgorod region, several miles from the Ukrainian border, where his brigade was “conducting training exercises.” Sakhibgareyev says he and his fellow soldiers would fire “wherever they were ordered to,” though what exactly they were firing at was unclear",
    "content": "Five weeks ago, 25-year-old contract soldier Albert Sakhibgareyev was in Russia’s Belgorod region, several miles from the Ukrainian border, where his brigade was “conducting training exercises.” Sakhibgareyev says he and his fellow soldiers would fire “wherever they were ordered to,” though what exactly they were firing at was unclear. According to him, he didn’t understand he was in a real war until the Ukrainian side started firing back; soon after that, he deserted. Meduza reports on how a soldier from Bashkortostan decided enough was enough."
  }
]
