[
  {
    "id": 0,
    "title": "Extended Diagnostics",
    "short": "In Angular v13.2.0, we released extended diagnostics, a new feature in the Angular compiler which gives more insight into your templates and how you might be able to improve them. These diagnostics give compile-time warnings with precise, actionable suggestions for your templates, catching bugs before you notice them.",
    "content": "In Angular v13.2.0, we released extended diagnostics, a new feature in the Angular compiler which gives more insight into your templates and how you might be able to improve them. These diagnostics give compile-time warnings with precise, actionable suggestions for your templates, catching bugs before you notice them."
  },
  {
    "id": 1,
    "title": "How the Angular Compiler Works",
    "short": "The Angular Compiler (which we call ngc) is the tool used to compile Angular applications and libraries. ngc is built on the TypeScript compiler (called tsc) and extends the process of compiling TypeScript code to add additional code generation related to Angular’s capabilities.",
    "content": "The Angular Compiler (which we call ngc) is the tool used to compile Angular applications and libraries. ngc is built on the TypeScript compiler (called tsc) and extends the process of compiling TypeScript code to add additional code generation related to Angular’s capabilities. Angular’s compiler serves as a bridge between developer experience and run time performance: Angular users author applications against an ergonomic, decorator-based API, and ngc translates this code into more efficient runtime instructions."
  },
  {
    "id": 2,
    "title": "Typed Forms: The RFC Is Here",
    "short": "For five years, strong types in the Forms package have been a top feature request. Issue (#13721) is the most popular issue of all time on the Angular repo. Many contributors have attempted to implement it over the years.",
    "content": "For five years, strong types in the Forms package have been a top feature request. Issue (#13721) is the most popular issue of all time on the Angular repo. Many contributors have attempted to implement it over the years. We’re proud to announce the Typed Forms Request for Comment. This is the first big step toward adding this long-sought feature to Angular."
  },
  {
    "id": 3,
    "title": "Discontinued Long Term Support for AngularJS",
    "short": "In January of 2018 we laid out our plans for the final releases of AngularJS before entering long-term support and last year, we extended the LTS due to the global pandemic until December 31, 2021. Well, friends, the time has come and we’re no longer supporting AngularJS.",
    "content": "In January of 2018 we laid out our plans for the final releases of AngularJS before entering long-term support and last year, we extended the LTS due to the global pandemic until December 31, 2021. Well, friends, the time has come and we’re no longer supporting AngularJS. We’re incredibly proud of the work that has been done with AngularJS and the way it evolved into its successor, Angular, which empowers an ecosystem of millions of developers. We encourage teams to upgrade their applications to the AngularJS successor Angular and benefit from productivity, scalability and improved performance. For teams still using AngularJS, please check out this post to explore some options."
  }
]
